using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace HZ.Framework
{
    public static class RegEx
    {

        /// <summary>
        /// 页面上不能输入的特殊字符
        /// </summary>
        public const string DANGEROUS_CHAR = "[^%&'`,;=?$\x22]+";

        /// <summary>
        /// Html标签
        /// </summary>
        public const string HTML = "<(.*)>(.*)</(.*)>|<(.*)/>";

        /// <summary>
        /// Email 地址
        /// </summary>
        public const string EMAIL = "^(\\w)+(\\.\\w+)*@(\\w)+((\\.\\w{2,5}){1,3})$";

        /// <summary>
        /// Tel 国内固定电话
        /// </summary>
        public const string TEL = "^(\\d{3.4}-)\\d{7,8}$";

        /// <summary>
        /// MobilePhone 国内手机号码
        /// </summary>
        public const string MOBILE_PHONE = "^1[3|4|5|8][0-9]\\d{8}$";

        /// <summary>
        /// 字母 数字 下划线 点
        /// </summary>
        public const string FILE_NAME = "^[-.,\\w]+$";

        /// <summary>
        /// 仅仅 字母 数字 下划线
        /// </summary>
        public const string CHAR_NUMBER_ONLY = "^[\\w]+$";

        /// <summary>
        /// 仅仅 中文 字母 数字 下划线 
        /// </summary>
        public const string CHINESE_ONLY = "^[(\\u4e00-\\u9fa5)(\\w)]*";

        /// <summary>
        /// 中文、日文 字母 数字 下划线 点 空格
        /// </summary>
        public const string CHINESE_NAME = "^[-(\\u4e00-\\u9fa5)(\\w). 　·(\\u0800-\\u4e00)]*$";

        /// <summary>
        /// 字母 数字 下划线 常用符号
        /// </summary>
        public const string CHAR_NUMBER = "^[-. :、·';@,|\\w]+$";

        /// <summary>
        /// 中文 字母 数字 常用符号
        /// </summary>
        public const string CHINESE = "[-. :、·';@,|(\\u4e00-\\u9fa5)|(\\w)]*";

        /// <summary>
        /// Decimal 正浮点数
        /// </summary>
        public const string DECIMAL = "^(([0-9]+\\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\\.[0-9]+)|([0-9]*[1-9][0-9]*))|([0-9])$";

        /// <summary>
        /// Int 正整数
        /// </summary>
        public const string INT = "^[0-9]*$";

        /// <summary>
        /// 网站 Url
        /// </summary>
        public const string URL = "^[a-zA-z]{3,5}://[^\\s]*$";

        /// <summary>
        /// 本地路径 (相对 或 绝对)
        /// </summary>
        public const string DIRECTORY = "(([a-zA-Z]:\\\\)|[/]|[.]|[\\\\])[^\\s]*";

        /// <summary>
        /// IP 地址
        /// </summary>
        public const string IP = "((2[0-4]\\d|25[0-5]|[01]?\\d\\d?)\\.){3}(2[0-4]\\d|25[0-5]|[01]?\\d\\d?)";

        /// <summary>
        /// Time
        /// </summary>
        public const string TIME = "(20|21|22|23|[0-1]?\\d):[0-5]?\\d:[0-5]?\\d|((((1[6-9]|[2-9]\\d)\\d{2})-(0?[13578]|1[02])-(0?[1-9]|[12]\\d|3[01]))|(((1[6-9]|[2-9]\\d)\\d{2})-(0?[13456789]|1[012])-(0?[1-9]|[12]\\d|30))|(((1[6-9]|[2-9]\\d)\\d{2})-0?2-(0?[1-9]|1\\d|2[0-8]))|(((1[6-9]|[2-9]\\d)(0[48]|[2468][048]|[13579][26])|((16|[2468][048]|[3579][26])00))-0?2-29-))";

        ///// <summary>
        ///// Date
        ///// </summary>
        //public const string DATE = "^(?:(?:(?:(?:1[6-9]|[2-9]\\d)?(?:0[48]|[2468][048]|[13579][26])|(?:(?:16|[2468][048]|[3579][26])00)))(\\/|-|\\.)(?:0?2\\1(?:29))$)|(?:(?:1[6-9]|[2-9]\\d)?\\d{2})(\\/|-|\\.)(?:(?:(?:0?[13578]|1[02])\\2(?:31))|(?:(?:0?[1,3-9]|1[0-2])\\2(29|30))|(?:(?:0?[1-9])|(?:1[0-2]))\\2(?:0?[1-9]|1\\d|2[0-8]))$";

        /// <summary>
        /// 日期 (用于 string )
        /// </summary>
        public const string DATE2 = @"^((((1[6-9]|[2-9]\d)\d{2})[-|/](0?[13578]|1[02])[-|/](0?[1-9]|[12]\d|3[01]))|(((1[6-9]|[2-9]\d)\d{2})[-|/](0?[13456789]|1[012])[-|/](0?[1-9]|[12]\d|30))|(((1[6-9]|[2-9]\d)\d{2})-0?2-(0?[1-9]|1\d|2[0-8]))|(((1[6-9]|[2-9]\d)(0[48]|[2468][048]|[13579][26])|((16|[2468][048]|[3579][26])00))-0?2-29-))$";

        /// <summary>
        /// 日期或日期加时间 (用于 datetime )
        /// </summary>
        public const string DATE3 = @"^(((((1[6-9]|[2-9]\d)\d{2})[-|/](0?[13578]|1[02])[-|/](0?[1-9]|[12]\d|3[01]))|(((1[6-9]|[2-9]\d)\d{2})[-|/](0?[13456789]|1[012])[-|/](0?[1-9]|[12]\d|30))|(((1[6-9]|[2-9]\d)\d{2})-0?2-(0?[1-9]|1\d|2[0-8]))|(((1[6-9]|[2-9]\d)(0[48]|[2468][048]|[13579][26])|((16|[2468][048]|[3579][26])00))-0?2-29-))( (20|21|22|23|[0-1]?\d):[0-5]?\d:[0-5]?\d)?)$";

        // 用于时间  @"^((20|21|22|23|[0-1]?\d):[0-5]?\d:[0-5]?\d)$"

        /// <summary>
        /// DateTime
        /// </summary>
        public const string DATE_TIME = "((((1[6-9]|[2-9]\\d)\\d{2})-(0?[13578]|1[02])-(0?[1-9]|[12]\\d|3[01]))|(((1[6-9]|[2-9]\\d)\\d{2})-(0?[13456789]|1[012])-(0?[1-9]|[12]\\d|30))|(((1[6-9]|[2-9]\\d)\\d{2})-0?2-(0?[1-9]|1\\d|2[0-8]))|(((1[6-9]|[2-9]\\d)(0[48]|[2468][048]|[13579][26])|((16|[2468][048]|[3579][26])00))-0?2-29-)) (20|21|22|23|[0-1]?\\d):[0-5]?\\d:[0-5]?\\d|((((1[6-9]|[2-9]\\d)\\d{2})-(0?[13578]|1[02])-(0?[1-9]|[12]\\d|3[01]))|(((1[6-9]|[2-9]\\d)\\d{2})-(0?[13456789]|1[012])-(0?[1-9]|[12]\\d|30))|(((1[6-9]|[2-9]\\d)\\d{2})-0?2-(0?[1-9]|1\\d|2[0-8]))|(((1[6-9]|[2-9]\\d)(0[48]|[2468][048]|[13579][26])|((16|[2468][048]|[3579][26])00))-0?2-29-))";

        /// <summary>
        /// 国内邮编
        /// </summary>
        public const string ZIP_CODE = "[1-9]\\d{5}(?!d)";

        /// <summary>
        /// 国内身份证号码
        /// </summary>
        public const string ID_CARD = "(^[1-9]\\d{7}((0\\d)|(1[0-2]))(([0|1|2]\\d)|3[0-1])\\d{3}$)|(^[1-9]\\d{5}[1-9]\\d{3}((0\\d)|(1[0-2]))(([0|1|2]\\d)|3[0-1])\\d{4}$)";

        /// <summary>
        /// 模板默认页
        /// </summary>
        public const string TPL_INDEX = ".*index.*\\.shtml";

    }
}
